/*
১. এমন একটি প্রোগ্রাম তৈরি করতে হবে যা ৩ ও ৫ দিয়ে ভাগ যায় ।

 = Algorithm :
 ১. প্রথমে লুপ  চলাইতে হবে, কারণ আমাদের দেখতে হবে যে অনেকগুলো সংখ্যার মধ্যে কোন সংখ্যাগুলো 3 ও ৫ দ্বারা । 
 ২. যদি ৩ দ্বারা ভাগ যায় তাহলে ঐ স্থানে ফু দেখাবে ।
*/

for(let i = 1; i <= 100; i++){
    if(i % 3 == 0 && i % 5 == 0){   // প্রথমে ৩ ও ৫ দ্বারা যাই কিনা তা চেককরা হচ্ছে ।
        console.log("Foobar");
    }else if(i % 3 == 0){
        console.log("foo");
    }else if(i % 5 == 0){
        console.log("bar");
    }else{
        console.log(i);
    }
}