//Calculate Factorial 
/*
১. ফ্যাকটোরিয়াল এর উদাহরণ ঃ 

1! = 1
2! = 2 x 1 
3! = 3 x 2 x 1
4! = 4 x 3 x 2 x 1

 প্রথম সংখ্যার সাথে দ্বিতীয় সংখ্যা গুণ হবে , তারপর দ্বিতীয় সংখ্যার সাথে ৩য় সংখ্যা গুণ হবে , এভাবে নিদিষ্ট ফ্যাকটোরিয়াল পযন্ত গুণ হতে থাকবে । 

 = যেহেতু কাজটি একটি নিদিষ্ট সংখ্যা পযন্ত কাজ করবে এর জন্য অবশ্যই লুপ চালাতে হবে । 
 ফর লুপের সাহায্যে এই কাজটি করা যাবে । অন্যভাবেও করা যাবে । 
*/

// প্রথম ফ্যাকটোরিয়াল গণনা শুরু হয়, ১ দ্বারা এর জন্য এর ভেরিয়েবল মানটি ১ নিলাম । 
//  তারপর নতুন একটি ভেরিয়েবলের মধ্যে, ফ্যাকটরিয়াল এর মান টি রেখে দেব । এর ফ্যাকটোরিয়াল * i  এর মান গুণ করতে হবে । 
// তাহলে নতুন যে মান পাবো তা  নতুন ভেরিয়েবলের মান হবে 

var factorial = 1;
 for( let i = 1; i <=7; i++){
  factorial = factorial * i;
 }
 console.log(factorial);

