//Calculate Factorial 
/*
১. ফ্যাকটোরিয়াল এর উদাহরণ ঃ 

1! = 1
2! = 2 x 1 
3! = 3 x 2 x 1
4! = 4 x 3 x 2 x 1

 প্রথম সংখ্যার সাথে দ্বিতীয় সংখ্যা গুণ হবে , তারপর দ্বিতীয় সংখ্যার সাথে ৩য় সংখ্যা গুণ হবে , এভাবে নিদিষ্ট ফ্যাকটোরিয়াল পযন্ত গুণ হতে থাকবে । 

 = যেহেতু কাজটি একটি নিদিষ্ট সংখ্যা পযন্ত কাজ করবে এর জন্য অবশ্যই লুপ চালাতে হবে । 
 ফর লুপের সাহায্যে এই কাজটি করা যাবে । অন্যভাবেও করা যাবে । 
*/

// প্রথম ফ্যাকটোরিয়াল গণনা শুরু হয়, ১ দ্বারা এর জন্য এর ভেরিয়েবল মানটি ১ নিলাম । 
//  তারপর নতুন একটি ভেরিয়েবলের মধ্যে, ফ্যাকটরিয়াল এর মান টি রেখে দেব । এর ফ্যাকটোরিয়াল * i  এর মান গুণ করতে হবে । 
// তাহলে নতুন যে মান পাবো তা  নতুন ভেরিয়েবলের মান হবে 



// Normal Factorial 
var factorial = 1;
 for( let i = 1; i <=7; i++){
  factorial = factorial * i;
 }
//  console.log(factorial);


 // Function Factorial 
/* 
1.  একটি ফাংশনে ফ্যাকটোরিয়াল নাম্বার হিসাব করা ।
২. এর জন্য প্রথমে একটি ফাংশ ডিক্লেয়ার করতে হবে । 
৩. একটি ইনপুট প্যারামিটার নিতে হবে  । 
৫. ফর লুপ এর মধ্যে এই কন্ডিশন গুলো সেট করে দিতে হবে । 
৪. এখন একটি ফ্যাকটোরিয়াল ভ্যালু সেট করতে হবে । অবশ্যই এর ভ্যালু ১ দিয়ে শুরু হবে। 
৫. ফ্যাকটোরিয়াল ভ্যালুকে আবার পুনরায় ডিক্লেয়ার  করতে হবে । যাতে সেই ভেরিয়েবলের মধ্যে সেই নতুন যে মানটি পাওয়া যাবে তা থাকে । 
৬. লুপ 
৬. ফ্যাকটোরিয়াল ১ এর ভ্যালুর সাথে  i এর ভ্যালু গুণ করতে হবে । 

*/

 function getFactorial (number){
        let factorial = 1;
    for(let i = 1; i <= number; i++){
        factorial = factorial * i;
    }
    return factorial;
 }
 const myFactorialValue = getFactorial(7);
 console.log(myFactorialValue);

